import random

people = [
    ["Лермонтов", "15.10.1814"],
    ["Столыпин", "14.04.1862"],
    ["Сталлоне", "06.06.1946"],
    ["Высоцкий", "25.01.1938"],
    ["Папанов", "31.10.1922"],
    ["Шевчук", "16.05.1957"],
    ["Путин", "07.10.1952"],
    ["Трамп", "14.06.1946"],
    ["Басилашвили", "26.09.1934"],
    ["Фрейндлих", "08.12.1934"],
]

correct = 0
sample = random.sample(people, 5)
sample = [["Test", "23.12.1994"]] + sample
days = [
    "первое",
    "второе",
    "третье",
    "четвертое",
    "пятое",
    "шестое",
    "седьмое",
    "восьмое",
    "девятое",
    "десятое",
    "одиннадцатое",
    "двенадцатое",
    "тринадцатое",
    "четырнадцатое",
    "пятнадцатое",
    "шестнадцатое",
    "семнадцатое",
    "восемнадцатое",
    "девятнадцатое",
    "двадцатое"
    "тридцать"
]
months = ["январь","февраль","март","апрель","май","июнь","июль","август","сентябрь","октябрь","ноябрь","декабрь"]

while True:
    for i, item in enumerate(sample):
        x = input(f'Введите dd.mm.yyyy {item[0]}')
        if x == item[1]:
            correct+=1
        else:
            splt = list(map(int, item[1].split('.')))
            s = ""
            if (splt[0]-1) < 21:
                s += f"{days[splt[0]-1]} "
            elif (splt[0]-1) < 30:
                s += f"{days[-2]} "
                s += f"{days[(splt[0]-1-20)-1]}"
            elif (splt[0]-1) == 30:
                s += f"{days[-1]} "
            else:
                s += "тридцать первое"
            s += " " + months[splt[1]-1]
            print(s, splt[-1])
    print(f'Правильных ответов: {0}')
    if input("Сыграть ещё раз, введите y: ") != "y":
        break
